Tekla Open API Reference for Tekla Structures 2025
ContourPoint Constructor (Point, Chamfer)
 Creates a new contour point using the given point and chamfer.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ContourPoint(
	Point P,
	Chamfer C
)
Public Sub New (
	P As Point,
	C As Chamfer
)
Parameters
P
Type: Tekla.Structures.Geometry3d.Point
The point (with X, Y and Z coordinates) to be used.
C
Type: Tekla.Structures.Model.Chamfer
The chamfer to be used.
See Also
Reference
ContourPoint Class
ContourPoint Overload
Tekla.Structures.Model Namespace